
export const 天干 = ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"];
export const 地支 = ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"];
export const 干轉五運: Record<string, string> = {
  甲: '土太过', 乙: '金不及', 丙: '水太过', 丁: '木不及', 戊: '火太过',
  己: '土不及', 庚: '金太过', 辛: '水不及', 壬: '木太过', 癸: '火不及'
}
export const 支轉六氣: Record<string, string> = {
  子: '少阴君火', 丑: '太阴湿土', 寅: '少阳相火', 卯: '阳明燥金', 辰: '太阳寒水', 巳: '厥阴风木',
  午: '少阴君火', 未: '太阴湿土', 申: '少阳相火', 酉: '阳明燥金', 戌: '太阳寒水', 亥: '厥阴风木',
}
export const 干轉洛書: Record<string, number> = {
  甲: 3,
  乙: 2,
  丙: 1,
  丁: 5,
  戊: 5,
  己: 5,
  庚: 6,
  辛: 7,
  壬: 8,
  癸: 4,
}
export const 支轉洛書: Record<string, number> = {
  子: 8,
  丑: 4,
  寅: 4,
  卯: 3,
  辰: 2,
  巳: 2,
  午: 9,
  未: 5,
  申: 5,
  酉: 6,
  戌: 7,
  亥: 7,

}
export const 干轉八卦 = (年干: string, 月干: string, 日干: string) => {
  const y = Number(干轉五運[年干][1] === '太')
  const m = Number(干轉五運[月干][1] === '太')
  const d = Number(干轉五運[日干][1] === '太')
  return '乾兌离震巽坎艮坤'[y << 2 | m << 1 | d]
}
